In [1]:
import numpy as np
import pandas as pd

In [2]:
#pandas series is a one dimensional array
#it can hold integers, floating numbers or strings
#simplest & direct way to create series
#series is a pandas object
series1=pd.Series([5,6,7])

In [3]:
series1

0    5
1    6
2    7
dtype: int64

In [4]:
#python list can be used to create series
list1=list([1,2,3,4])

In [5]:
list1

[1, 2, 3, 4]

In [6]:
type(list1)

list

In [8]:
lists=pd.Series(list1)

In [9]:
type(lists)

pandas.core.series.Series

In [7]:
list2=(["Cricket","Football","Tennis","Baseball"])

In [10]:
#first argument is data, you can also write data=list2
#second argument is index label, you can also write index=list1
series2=pd.Series(list2,list1)

In [11]:
series2

1     Cricket
2    Football
3      Tennis
4    Baseball
dtype: object

In [13]:
type(series2)

pandas.core.series.Series

In [16]:
#Dictionary
py_dic={
    "Name":"Akhilendra",
    "Age":36,
    "City":"noida",
    "Country":"India"
}

In [17]:
print(py_dic)

{'Name': 'Akhilendra', 'Age': 36, 'City': 'noida', 'Country': 'India'}

In [18]:
type(py_dic)

dict

In [19]:
series3=pd.Series(py_dic)

In [20]:
series3

Name       Akhilendra
Age                36
City            noida
Country         India
dtype: object

In [21]:
py_dic["Name"]

'Akhilendra'

In [23]:
py_dic['Age']

36

In [27]:
#you can also create index with pandas instead of using existing list/series

index1=pd.Index([1,2,3,4])

In [28]:
index1

Int64Index([1, 2, 3, 4], dtype='int64')

In [29]:
type(index1)

pandas.core.indexes.numeric.Int64Index

In [30]:
#series is used for building data frames in pandas
#pandas data frames are similar to data frames in R
#they are table like structures where you can select, manipulate, 
#and perform processing

#you can create dataframes with the pd.DataFrame function
#we can use arange function from numpy to create a numpy array and then
#convert it to a data frame

#when you load data from external files like csv using pd commands, 
#they are loaded in data frame formats

#you can create data frames from all kinds of python data types like
#list, dictionaries, tuples
array15=np.arange(0,25).reshape(5,5)

In [31]:
array15

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [36]:
print(pd.DataFrame(array15))
type(pd.DataFrame(array15))

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

pandas.core.frame.DataFrame

---

In [38]:
#Let's create a more advanced data frame
df1=pd.DataFrame(array15,['A','B','C','D','E'],
                  ['Column1','Column2','Column3','Column4','Column5'])

In [37]:
df1

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19
E       20       21       22       23       24

In [41]:
type(df1)

pandas.core.frame.DataFrame

In [42]:
df1.head()

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19
E       20       21       22       23       24

In [43]:
first_c=df1["Column1"]

In [44]:
type(first_c)

pandas.core.series.Series

In [45]:
first_c

A     0
B     5
C    10
D    15
E    20
Name: Column1, dtype: int64

In [46]:
#Add new column

df1['Column6']=[25,26,27,28,29]

In [47]:
df1

   Column1  Column2  Column3  Column4  Column5  Column6
A        0        1        2        3        4       25
B        5        6        7        8        9       26
C       10       11       12       13       14       27
D       15       16       17       18       19       28
E       20       21       22       23       24       29

In [51]:
#Drop column
#by default - python is looking for Column 6 in row labels - thus the error
df1.drop('Column6')

KeyError: "['Column6'] not found in axis"

In [52]:
df1.drop('Column6',axis=1)

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19
E       20       21       22       23       24

In [53]:
df1

   Column1  Column2  Column3  Column4  Column5  Column6
A        0        1        2        3        4       25
B        5        6        7        8        9       26
C       10       11       12       13       14       27
D       15       16       17       18       19       28
E       20       21       22       23       24       29

In [54]:
#This will drop column 6 from original dataset
df1.drop('Column6',axis=1,inplace=True)

In [55]:
df1

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19
E       20       21       22       23       24

In [56]:
df1.drop('E')

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19

In [57]:
df1

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19
E       20       21       22       23       24

In [58]:
df1.drop('E',inplace=True)

In [59]:
df1

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19

In [60]:
#Let's practice slicing

In [61]:
df1['Column1'][2]

10

In [64]:
#beginning is inclusive, end is not (if specified)
df1["Column1"][2:]

C    10
D    15
Name: Column1, dtype: int64

In [65]:
df1[2:4]

   Column1  Column2  Column3  Column4  Column5
C       10       11       12       13       14
D       15       16       17       18       19

In [66]:
df1[:2]
#NOT INCLUSIVE!

   Column1  Column2  Column3  Column4  Column5
A        0        1        2        3        4
B        5        6        7        8        9

---

In [67]:
#iloc and loc methods are useful and popular while slicing series or DFs
#you can specify the row label with loc and index # with iloc
df1.loc["B"]

Column1    5
Column2    6
Column3    7
Column4    8
Column5    9
Name: B, dtype: int64

In [72]:
df1.iloc[0]

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: A, dtype: int64

In [73]:
df1.loc["B","Column3"]

7

In [76]:
df1.loc[["B","E"],["Column1","Column3"]]

   Column1  Column3
B      5.0      7.0
E      NaN      NaN

In [78]:
df1.loc[["B","D"],["Column1","Column3"]]

   Column1  Column3
B        5        7
D       15       17

In [77]:
df1>15

   Column1  Column2  Column3  Column4  Column5
A    False    False    False    False    False
B    False    False    False    False    False
C    False    False    False    False    False
D    False     True     True     True     True

In [79]:
#Let's work with an actual dataset
#https://archive.ics.uci.edu/ml/machine-learning-databases/00445/

In [80]:
import os

In [81]:
os.getcwd()

'/Users/jonzimmerman/Desktop/Udemy Courses/Data Science Course - 2019/Extra Python courses'

In [82]:
os.chdir('/Users/jonzimmerman/Desktop/Udemy Courses/Data Science Course - 2019/Extra Python courses/Section 19/Absenteeism_at_work_AAA')

In [83]:
os.getcwd()

'/Users/jonzimmerman/Desktop/Udemy Courses/Data Science Course - 2019/Extra Python courses/Section 19/Absenteeism_at_work_AAA'

In [84]:
df2=pd.read_csv("Absenteeism_at_work.csv",sep=';')

In [86]:
df2.head(6)

,ID,Reason for absence,Month of absence,Day of the week,Seasons,Transportation expense,Distance from Residence to Work,Service time,Age,Work load Average/day,...,Disciplinary failure,Education,Son,Social drinker,Social smoker,Pet,Weight,Height,Body mass index,Absenteeism time in hours
0,11,26,7,3,1,289,36,13,33,239.554,...,0,1,2,1,0,1,90,172,30,4
1,36,0,7,3,1,118,13,18,50,239.554,...,1,1,1,1,0,0,98,178,31,0
2,3,23,7,4,1,179,51,18,38,239.554,...,0,1,0,1,0,0,89,170,31,2
3,7,7,7,5,1,279,5,14,39,239.554,...,0,1,2,1,1,0,68,168,24,4
4,11,23,7,5,1,289,36,13,33,239.554,...,0,1,2,1,0,1,90,172,30,2
5,3,23,7,6,1,179,51,18,38,239.554,...,0,1,0,1,0,0,89,170,31,2

In [87]:
df2.get_dtype_counts()

/opt/anaconda3/envs/mlcourse/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

float64     1
int64      20
dtype: int64

In [89]:
#you can use select dtypes function to select desired dtype
#you can use filter function to select a specific column or 
#row based on condition
df2.filter(like="Social").head(25)

    Social drinker  Social smoker
0                1              0
1                1              0
2                1              0
3                1              1
4                1              0
5                1              0
6                1              0
7                1              0
8                1              0
9                0              0
10               1              0
11               1              0
12               1              0
13               1              0
14               1              0
15               1              0
16               1              0
17               1              0
18               0              0
19               0              0
20               0              0
21               1              0
22               1              0
23               1              0
24               1              0

In [90]:
#Select first 10 rows of columns with 'eig' in titles
df2.filter(regex='eig').head(10)

   Weight  Height
0      90     172
1      98     178
2      89     170
3      68     168
4      90     172
5      89     170
6      80     172
7      65     168
8      95     196
9      88     172

In [93]:
df2.filter(regex='ar').head(2)

   Hit target  Disciplinary failure
0          97                     0
1          97                     1

In [96]:
#Find number of missing values by column
df2.isnull().sum()

ID                                 0
Reason for absence                 0
Month of absence                   0
Day of the week                    0
Seasons                            0
Transportation expense             0
Distance from Residence to Work    0
Service time                       0
Age                                0
Work load Average/day              0
Hit target                         0
Disciplinary failure               0
Education                          0
Son                                0
Social drinker                     0
Social smoker                      0
Pet                                0
Weight                             0
Height                             0
Body mass index                    0
Absenteeism time in hours          0
dtype: int64

In [98]:
df2.shape
#740 rows
#21 columns

(740, 21)

In [103]:
#Summary statistics for the numerical columns
df2.describe()

,ID,Reason for absence,Month of absence,Day of the week,Seasons,Transportation expense,Distance from Residence to Work,Service time,Age,Work load Average/day,...,Disciplinary failure,Education,Son,Social drinker,Social smoker,Pet,Weight,Height,Body mass index,Absenteeism time in hours
count,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,...,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000,740.000000
mean,18.017568,19.216216,6.324324,3.914865,2.544595,221.329730,29.631081,12.554054,36.450000,271.490235,...,0.054054,1.291892,1.018919,0.567568,0.072973,0.745946,79.035135,172.114865,26.677027,6.924324
std,11.021247,8.433406,3.436287,1.421675,1.111831,66.952223,14.836788,4.384873,6.478772,39.058116,...,0.226277,0.673238,1.098489,0.495749,0.260268,1.318258,12.883211,6.034995,4.285452,13.330998
min,1.000000,0.000000,0.000000,2.000000,1.000000,118.000000,5.000000,1.000000,27.000000,205.917000,...,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,56.000000,163.000000,19.000000,0.000000
25%,9.000000,13.000000,3.000000,3.000000,2.000000,179.000000,16.000000,9.000000,31.000000,244.387000,...,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,69.000000,169.000000,24.000000,2.000000
50%,18.000000,23.000000,6.000000,4.000000,3.000000,225.000000,26.000000,13.000000,37.000000,264.249000,...,0.000000,1.000000,1.000000,1.000000,0.000000,0.000000,83.000000,170.000000,25.000000,3.000000
75%,28.000000,26.000000,9.000000,5.000000,4.000000,260.000000,50.000000,16.000000,40.000000,294.217000,...,0.000000,1.000000,2.000000,1.000000,0.000000,1.000000,89.000000,172.000000,31.000000,8.000000
max,36.000000,28.000000,12.000000,6.000000,4.000000,388.000000,52.000000,29.000000,58.000000,378.884000,...,1.000000,4.000000,4.000000,1.000000,1.000000,8.000000,108.000000,196.000000,38.000000,120.000000

In [105]:
df2.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,740.0,18.017568,11.021247,1.000,9.000,18.000,28.000,36.000
Reason for absence,740.0,19.216216,8.433406,0.000,13.000,23.000,26.000,28.000
Month of absence,740.0,6.324324,3.436287,0.000,3.000,6.000,9.000,12.000
Day of the week,740.0,3.914865,1.421675,2.000,3.000,4.000,5.000,6.000
Seasons,740.0,2.544595,1.111831,1.000,2.000,3.000,4.000,4.000
Transportation expense,740.0,221.329730,66.952223,118.000,179.000,225.000,260.000,388.000
Distance from Residence to Work,740.0,29.631081,14.836788,5.000,16.000,26.000,50.000,52.000
Service time,740.0,12.554054,4.384873,1.000,9.000,13.000,16.000,29.000
Age,740.0,36.450000,6.478772,27.000,31.000,37.000,40.000,58.000
Work load Average/day,740.0,271.490235,39.058116,205.917,244.387,264.249,294.217,378.884
Hit target,740.0,94.587838,3.779313,81.000,93.000,95.000,97.000,100.000
Disciplinary failure,740.0,0.054054,0.226277,0.000,0.000,0.000,0.000,1.000
Education,740.0,1.291892,0.673238,1.000,1.000,1.000,1.000,4.000
Son,740.0,1.018919,1.098489,0.000,0.000,1.000,2.000,4.000
Social drinker,740.0,0.567568,0.495749,0.000,0.000,1.000,1.000,1.000
Social smoker,740.0,0.072973,0.260268,0.000,0.000,0.000,0.000,1.000
Pet,740.0,0.745946,1.318258,0.000,0.000,0.000,1.000,8.000
Weight,740.0,79.035135,12.883211,56.000,69.000,83.000,89.000,108.000
Height,740.0,172.114865,6.034995,163.000,169.000,170.000,172.000,196.000
Body mass index,740.0,26.677027,4.285452,19.000,24.000,25.000,31.000,38.000
Absenteeism time in hours,740.0,6.924324,13.330998,0.000,2.000,3.000,8.000,120.000

In [107]:
df2.memory_usage(deep=True)

Index                               128
ID                                 5920
Reason for absence                 5920
Month of absence                   5920
Day of the week                    5920
Seasons                            5920
Transportation expense             5920
Distance from Residence to Work    5920
Service time                       5920
Age                                5920
Work load Average/day              5920
Hit target                         5920
Disciplinary failure               5920
Education                          5920
Son                                5920
Social drinker                     5920
Social smoker                      5920
Pet                                5920
Weight                             5920
Height                             5920
Body mass index                    5920
Absenteeism time in hours          5920
dtype: int64

In [108]:
#we may not need 64 bit for these columns
#we can reduce the bit size to achieve optimum performance
df2['Reason for absence']=df2['Reason for absence'].astype(np.int8)

In [109]:
#saving memory by casting it to lower bit size
df2.memory_usage(deep=True)

Index                               128
ID                                 5920
Reason for absence                  740
Month of absence                   5920
Day of the week                    5920
Seasons                            5920
Transportation expense             5920
Distance from Residence to Work    5920
Service time                       5920
Age                                5920
Work load Average/day              5920
Hit target                         5920
Disciplinary failure               5920
Education                          5920
Son                                5920
Social drinker                     5920
Social smoker                      5920
Pet                                5920
Weight                             5920
Height                             5920
Body mass index                    5920
Absenteeism time in hours          5920
dtype: int64

In [110]:
df2.sort_values(["Height"],ascending=True).head(5)

,ID,Reason for absence,Month of absence,Day of the week,Seasons,Transportation expense,Distance from Residence to Work,Service time,Age,Work load Average/day,...,Disciplinary failure,Education,Son,Social drinker,Social smoker,Pet,Weight,Height,Body mass index,Absenteeism time in hours
38,2,28,8,6,1,235,29,12,48,205.917,...,0,1,1,0,1,5,88,163,33,8
469,2,23,7,2,1,235,29,12,48,230.290,...,0,1,1,0,1,5,88,163,33,1
203,2,0,4,2,3,235,29,12,48,326.452,...,1,1,1,0,1,5,88,163,33,0
33,2,18,8,2,1,235,29,12,48,205.917,...,0,1,1,0,1,5,88,163,33,8
31,2,18,8,5,1,235,29,12,48,205.917,...,0,1,1,0,1,5,88,163,33,8